## Data Analysis Process

1. Ask questions

2. Wrangle data -- gather/assess/clean

3. Perform EDA (Exploratory Data Analysis)

4. Draw Conclusions

5. Communicate your results

### Reading in Data

In [11]:
import pandas as pd
df1 = pd.read_csv('AllstarFull.csv')
df1.head()

    playerID  yearID  gameNum        gameID teamID lgID   GP  startingPos
0  gomezle01    1933        0  ALS193307060    NYA   AL  1.0          1.0
1  ferreri01    1933        0  ALS193307060    BOS   AL  1.0          2.0
2  gehrilo01    1933        0  ALS193307060    NYA   AL  1.0          3.0
3  gehrich01    1933        0  ALS193307060    DET   AL  1.0          4.0
4  dykesji01    1933        0  ALS193307060    CHA   AL  1.0          5.0

In [2]:
# print the column labels in the dataframe
for i,v in enumerate(df1.columns):
    print(i,v)

0 playerID
1 yearID
2 gameNum
3 gameID
4 teamID
5 lgID
6 GP
7 startingPos

In [3]:
df2 = pd.read_csv('online-job-postings.csv')
df2.head()

,jobpost,date,Title,Company,AnnouncementCode,Term,Eligibility,Audience,StartDate,Duration,...,Salary,ApplicationP,OpeningDate,Deadline,Notes,AboutC,Attach,Year,Month,IT
0,AMERIA Investment Consulting Company\r\nJOB TI...,"Jan 5, 2004",Chief Financial Officer,AMERIA Investment Consulting Company,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,"To apply for this position, please submit a\r\...",NaN,26 January 2004,NaN,NaN,NaN,2004,1,False
1,International Research & Exchanges Board (IREX...,"Jan 7, 2004",Full-time Community Connections Intern (paid i...,International Research & Exchanges Board (IREX),NaN,NaN,NaN,NaN,NaN,3 months,...,NaN,Please submit a cover letter and resume to:\r\...,NaN,12 January 2004,NaN,The International Research & Exchanges Board (...,NaN,2004,1,False
2,Caucasus Environmental NGO Network (CENN)\r\nJ...,"Jan 7, 2004",Country Coordinator,Caucasus Environmental NGO Network (CENN),NaN,NaN,NaN,NaN,NaN,Renewable annual contract\r\nPOSITION,...,NaN,Please send resume or CV toursula.kazarian@......,NaN,20 January 2004\r\nSTART DATE: February 2004,NaN,The Caucasus Environmental NGO Network is a\r\...,NaN,2004,1,False
3,Manoff Group\r\nJOB TITLE: BCC Specialist\r\n...,"Jan 7, 2004",BCC Specialist,Manoff Group,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Please send cover letter and resume to Amy\r\n...,NaN,23 January 2004\r\nSTART DATE: Immediate,NaN,NaN,NaN,2004,1,False
4,Yerevan Brandy Company\r\nJOB TITLE: Software...,"Jan 10, 2004",Software Developer,Yerevan Brandy Company,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Successful candidates should submit\r\n- CV; \...,NaN,"20 January 2004, 18:00",NaN,NaN,NaN,2004,1,True

#### Headers

In [7]:
df2 = pd.read_csv('online-job-postings.csv', header=0)
df2.head()

# row 2 was used as the header and everything above that was cut off. 
# by default, read_csv ueses header=0
# If columns labels are not included
# use header=None to prevent first line of data from being misinterpreted as column labels

,jobpost,date,Title,Company,AnnouncementCode,Term,Eligibility,Audience,StartDate,Duration,...,Salary,ApplicationP,OpeningDate,Deadline,Notes,AboutC,Attach,Year,Month,IT
0,AMERIA Investment Consulting Company\r\nJOB TI...,"Jan 5, 2004",Chief Financial Officer,AMERIA Investment Consulting Company,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,"To apply for this position, please submit a\r\...",NaN,26 January 2004,NaN,NaN,NaN,2004,1,False
1,International Research & Exchanges Board (IREX...,"Jan 7, 2004",Full-time Community Connections Intern (paid i...,International Research & Exchanges Board (IREX),NaN,NaN,NaN,NaN,NaN,3 months,...,NaN,Please submit a cover letter and resume to:\r\...,NaN,12 January 2004,NaN,The International Research & Exchanges Board (...,NaN,2004,1,False
2,Caucasus Environmental NGO Network (CENN)\r\nJ...,"Jan 7, 2004",Country Coordinator,Caucasus Environmental NGO Network (CENN),NaN,NaN,NaN,NaN,NaN,Renewable annual contract\r\nPOSITION,...,NaN,Please send resume or CV toursula.kazarian@......,NaN,20 January 2004\r\nSTART DATE: February 2004,NaN,The Caucasus Environmental NGO Network is a\r\...,NaN,2004,1,False
3,Manoff Group\r\nJOB TITLE: BCC Specialist\r\n...,"Jan 7, 2004",BCC Specialist,Manoff Group,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Please send cover letter and resume to Amy\r\n...,NaN,23 January 2004\r\nSTART DATE: Immediate,NaN,NaN,NaN,2004,1,False
4,Yerevan Brandy Company\r\nJOB TITLE: Software...,"Jan 10, 2004",Software Developer,Yerevan Brandy Company,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Successful candidates should submit\r\n- CV; \...,NaN,"20 January 2004, 18:00",NaN,NaN,NaN,2004,1,True

##### Specify your own column labels like this.

In [18]:
labels = ['ID', 'YEAR', 'NUMBER', 'GAMEID', 'TEAMID', 'LGID', 'GP', 'POINT']
df3 = pd.read_csv('AllstarFull.csv', names=labels, header=0)  # header=0 replace the old one
df3.head()

          ID  YEAR  NUMBER        GAMEID TEAMID LGID   GP  POINT
0  gomezle01  1933       0  ALS193307060    NYA   AL  1.0    1.0
1  ferreri01  1933       0  ALS193307060    BOS   AL  1.0    2.0
2  gehrilo01  1933       0  ALS193307060    NYA   AL  1.0    3.0
3  gehrich01  1933       0  ALS193307060    DET   AL  1.0    4.0
4  dykesji01  1933       0  ALS193307060    CHA   AL  1.0    5.0

### Index

Instead of using the default index (integers incrementing by 1 from 0), you can specify one or more of your columns to be the index of your dataframe.

In [23]:
df4 = pd.read_csv('AllstarFull.csv', index_col='playerID')
df4.head()

           yearID  gameNum        gameID teamID lgID   GP  startingPos
playerID
gomezle01    1933        0  ALS193307060    NYA   AL  1.0          1.0
ferreri01    1933        0  ALS193307060    BOS   AL  1.0          2.0
gehrilo01    1933        0  ALS193307060    NYA   AL  1.0          3.0
gehrich01    1933        0  ALS193307060    DET   AL  1.0          4.0
dykesji01    1933        0  ALS193307060    CHA   AL  1.0          5.0

In [24]:
df5 = pd.read_csv('AllstarFull.csv', index_col= ['playerID','yearID'])
df5.head()

                  gameNum        gameID teamID lgID   GP  startingPos
playerID  yearID
gomezle01 1933          0  ALS193307060    NYA   AL  1.0          1.0
ferreri01 1933          0  ALS193307060    BOS   AL  1.0          2.0
gehrilo01 1933          0  ALS193307060    NYA   AL  1.0          3.0
gehrich01 1933          0  ALS193307060    DET   AL  1.0          4.0
dykesji01 1933          0  ALS193307060    CHA   AL  1.0          5.0

### Writing CSV Files

In [26]:
df3.to_csv('AllstarFull.csv')
df = pd.read_csv('AllstarFull.csv')
df.head()

   Unnamed: 0         ID  YEAR  NUMBER        GAMEID TEAMID LGID   GP  POINT
0           0  gomezle01  1933       0  ALS193307060    NYA   AL  1.0    1.0
1           1  ferreri01  1933       0  ALS193307060    BOS   AL  1.0    2.0
2           2  gehrilo01  1933       0  ALS193307060    NYA   AL  1.0    3.0
3           3  gehrich01  1933       0  ALS193307060    DET   AL  1.0    4.0
4           4  dykesji01  1933       0  ALS193307060    CHA   AL  1.0    5.0

What's this Unnamed:0? to_csv() will store our index unless we tell it not to. To make it ignore the index, we have to provide the parameter index=False

In [27]:
df3.to_csv('AllstarFull.csv', index=False)
df = pd.read_csv('AllstarFull.csv')
df.head()

          ID  YEAR  NUMBER        GAMEID TEAMID LGID   GP  POINT
0  gomezle01  1933       0  ALS193307060    NYA   AL  1.0    1.0
1  ferreri01  1933       0  ALS193307060    BOS   AL  1.0    2.0
2  gehrilo01  1933       0  ALS193307060    NYA   AL  1.0    3.0
3  gehrich01  1933       0  ALS193307060    DET   AL  1.0    4.0
4  dykesji01  1933       0  ALS193307060    CHA   AL  1.0    5.0

### Assessing and Building Intuition

In [29]:
# this returns a tuple of the dimensions of the dataframe
df.shape

(5148, 8)

In [30]:
# this returns the datatypes of the columns
df.dtypes

ID         object
YEAR        int64
NUMBER      int64
GAMEID     object
TEAMID     object
LGID       object
GP        float64
POINT     float64
dtype: object

In [31]:
# this displays a concise summary of the dataframe,
# including the number of non-null values in each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5148 entries, 0 to 5147
Data columns (total 8 columns):
ID        5148 non-null object
YEAR      5148 non-null int64
NUMBER    5148 non-null int64
GAMEID    5099 non-null object
TEAMID    5148 non-null object
LGID      5148 non-null object
GP        5129 non-null float64
POINT     1600 non-null float64
dtypes: float64(2), int64(2), object(4)
memory usage: 321.8+ KB

In [32]:
# this returns the number of unique values in each column
df.nunique()

ID        1774
YEAR        84
NUMBER       3
GAMEID     106
TEAMID      45
LGID         2
GP           2
POINT       11
dtype: int64

In [34]:
# this returns useful descriptive statistics for each column of data
df.describe()

              YEAR       NUMBER           GP        POINT
count  5148.000000  5148.000000  5129.000000  1600.000000
mean   1977.040210     0.134810     0.777929     5.031250
std      24.008874     0.458167     0.415679     2.657007
min    1933.000000     0.000000     0.000000     0.000000
25%    1958.000000     0.000000     1.000000     3.000000
50%    1977.000000     0.000000     1.000000     5.000000
75%    1999.000000     0.000000     1.000000     7.000000
max    2016.000000     2.000000     1.000000    10.000000

In [35]:
df.tail(2)

             ID  YEAR  NUMBER        GAMEID TEAMID LGID   GP  POINT
5146  teherju01  2016       0  ALS201607120    ATL   NL  1.0    NaN
5147  zobribe01  2016       0  ALS201607120    CHN   NL  1.0    4.0

In [45]:
df.isnull().sum()

ID           0
YEAR         0
NUMBER       0
GAMEID      49
TEAMID       0
LGID         0
GP          19
POINT     3548
dtype: int64

In [47]:
df.POINT.mean()

5.03125

### Indexing and Selecting Data in Pandas

In [36]:
# View the index number and label for each column
for i, v in enumerate(df.columns):
    print(i, v)

0 ID
1 YEAR
2 NUMBER
3 GAMEID
4 TEAMID
5 LGID
6 GP
7 POINT

- We can select data using `loc` and `iloc`. `loc` uses labels of rows or columns to select data.

In [40]:
# select all the columns from 'id' to the last mean column
df_first_half = df.loc[:,'ID':'TEAMID']
df_first_half.head()

          ID  YEAR  NUMBER        GAMEID TEAMID
0  gomezle01  1933       0  ALS193307060    NYA
1  ferreri01  1933       0  ALS193307060    BOS
2  gehrilo01  1933       0  ALS193307060    NYA
3  gehrich01  1933       0  ALS193307060    DET
4  dykesji01  1933       0  ALS193307060    CHA

In [44]:
# repeat the step above using index numbers
df_first_half = df.iloc[:,:5]
df_first_half.head()

          ID  YEAR  NUMBER        GAMEID TEAMID
0  gomezle01  1933       0  ALS193307060    NYA
1  ferreri01  1933       0  ALS193307060    BOS
2  gehrilo01  1933       0  ALS193307060    NYA
3  gehrich01  1933       0  ALS193307060    DET
4  dykesji01  1933       0  ALS193307060    CHA

## Data Cleaning
1. Missing Data (Missing data is an issue that should be handled differeently depending on several factors such as the reason those values are missing and whether the occurrences seem random. One way of handling them is imputing them with the mean.
2. Duplicate Data (There are multiple reasons you may end up with duplicated data, like combined data sources, or human error
3. Incorrect data types (Incorrect data type is also a problem data analysts frequently come across

In [ ]:
mean = df['xxx'].mean()
df ['xxx'] = df['xxx'].fillna(mean)
OR 
df['xxx'].fillna(mean, inplace=True)

In [ ]:
df.duplicated()
sum(df.duplicated())
df.drop_duplicates(inplace=True)

In [ ]:
# e.g. timestamps are represented as strings instead of datatimes
df['timestamp'] = pd.to_datetime(df['timestamp'] )